# Projeto Técnicas de programação I

## Análise exploratória de dados/Pandas

- Nomes:
 - Gabriel Guimarães de Oliveira Mourão
 - Rafael Ribeiro de Lima
 - William James Erthal

- Turma: 
 - #970 LM Tech Data Talents

- Módulo 3
 - [DS-PY-004] TÉCNICAS DE PROGRAMAÇÃO I (PY)

 - Ada LM Tech Data Talents

Nesse projeto trabalharemos com dados fictícios de investidores.

São 3 arquivos que devem ser carregados para responder as perguntas abaixo.

Para a entrega, coloque o notebook respondido no seu github (um por grupo)!

Informações

Cadastro:
- **id** : Identificação do investidor
- **Nome** : Nome completo do investidor 
- **Sexo** : Feminino ou masculino
- **Nasc** : Data de nascimento
- **Idade** : Idade do investidor 
- **Email** : E-mail do investidor
- **Lat_long** : Dados geográficos do investidor
- **Job** : Profisão do investidor ou do seu responsável (em inglês)
- **Estado** : Estado onde o investidor reside

Investimento:
- **id** : Identificação do investidor
- **Salario** : Renda do investidor ou seu responsável
- **Perfil** : Perfil de investimento
- **Ativo01, Ativo02, Ativo03, Ativo04, Ativo05, Ativo06, Ativo07** : O quanto de dinheiro o investidor colocou em cada ativo
- **Nota1, Nota2** : O quanto o investidor está satisfeito com nossa empresa (2 avaliações)

Lembrando que esses dados são irreais e fictícios

Arquivo cadastro.csv


Arquivo investimento.csv (dividido em 2 partes)

### Critérios de avaliação

Os seguintes itens serão avaliados:

1. Reprodutibilidade do código: seu código será executado e precisa gerar os mesmos resultados apresentados por você;

2. Clareza: seu código precisa ser claro e deve existir uma linha de raciocínio direta. Comente o código em pontos que julgar necessário para o entendimento total;

3. Explicação de todos os processos feitos e decisões tomadas

## Informações Gerais sobre o Projeto

- O projeto poderá ser desenvolvido __individualmente__ ou em __grupos com até 4 pessoas__, caos façam em grupos enviar a relação de alunos do grupo para o professor;


- Data de Entrega: 14/04/2023;

- Entrega: Através do _Class_

## 1 - Carregar os arquivos e cadastro, investimento1 e investimento2 e mostrar a quantidade de linhas de cada um, além das informações desses dataframes

In [50]:
import pandas as pd
import datetime as dt
import os

In [51]:
# Leitura dos arquivos cadastro.csv, investimento_parte1.csv e investimento_parte2.csv
path = os.getcwd()

dfc = pd.read_csv(f'{path}/db/cadastros/cadastro.csv')
dfi1 = pd.read_csv(f'{path}/db/investimentos/investimento_parte1.csv')
dfi2 = pd.read_csv(f'{path}/db/investimentos/investimento_parte2.csv')

In [52]:
# Quantidade de linhas de cadastro.csv
print(f'O dataframe de "Cadastro" possui {dfc.shape[0]} linhas')

O dataframe de "Cadastro" possui 38754 linhas

In [53]:
# Quantidade de linhas de investimento_parte1.csv
print(f'O dataframe de "Investimento_parte1" possui {dfi1.shape[0]} linhas')

O dataframe de "Investimento_parte1" possui 20000 linhas

In [54]:
# Quantidade de linhas de investimento_parte2.csv
print(f'O dataframe de "Investimento_parte2" possui {dfi2.shape[0]} linhas')

O dataframe de "Investimento_parte2" possui 24052 linhas

In [55]:
# Primeiras linhas de cadastro.csv
dfc.head()

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF
2,id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF
3,id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF
4,id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS

In [56]:
# Primeiras linhas de investimento_parte1.csv
dfi1.head()

,id,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0011529,$2.25,Agressivo,1311.38,NaN,NaN,29267.48,4993.30,NaN,506.40,73.007216,30.025005
1,id0030644,$24.57,Agressivo,1007.38,4846.66,2717.82,12532.15,4282.98,NaN,499.93,20.000123,29.477728
2,id0019311,$367.53,Moderado,1128.99,4668.94,3092.60,9777.77,4246.30,2007.83,509.50,24.901450,49.659852
3,id0036705,$23.26,Moderado,1185.26,4782.17,2669.05,14047.87,6026.84,2064.09,489.82,14.246718,29.271206
4,id0001368,$6.31,Conservador,957.64,5585.52,NaN,5067.08,4030.51,2022.61,507.39,5.922253,11.840601

In [57]:
# Primeiras linhas de investimento_parte2.csv
dfi2.head()

,id,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0000859,$51483.81,Agressivo,1273.95,5080.37,3565.44,NaN,5635.72,NaN,513.38,47.599278,7.057028
1,id0022202,$457.43,Conservador,1121.09,4927.51,3911.58,5511.7,5593.40,NaN,497.28,37.353757,61.516665
2,id0002056,$93245.46,Moderado,NaN,5283.71,2914.76,NaN,4707.33,NaN,499.06,98.895407,45.197866
3,id0005674,$3044.00,Agressivo,1353.76,5827.28,2998.24,16341.7,4712.65,2007.44,515.10,50.658089,65.660735
4,id0004777,$880.30,Agressivo,NaN,5695.77,3525.98,NaN,4147.29,NaN,506.77,72.993882,55.530580

## 2 - Juntar os dataframes de investimento1 e investimento2 em um só e ver a quantidade de linhas

In [58]:
# Concatenando as duas tabelas de investimento 
dfi = pd.concat([dfi1,dfi2])

In [59]:
# Quantidade de linhas de dfi (parte1 concatenado com parte2)
print(f'O dataframe de "Investimento" concatenado possui {dfi.shape[0]} linhas')

O dataframe de "Investimento" concatenado possui 44052 linhas

In [60]:
# Primeiras linhas de dfi (parte1 concatenado com parte2)
dfi.head()

,id,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0011529,$2.25,Agressivo,1311.38,NaN,NaN,29267.48,4993.30,NaN,506.40,73.007216,30.025005
1,id0030644,$24.57,Agressivo,1007.38,4846.66,2717.82,12532.15,4282.98,NaN,499.93,20.000123,29.477728
2,id0019311,$367.53,Moderado,1128.99,4668.94,3092.60,9777.77,4246.30,2007.83,509.50,24.901450,49.659852
3,id0036705,$23.26,Moderado,1185.26,4782.17,2669.05,14047.87,6026.84,2064.09,489.82,14.246718,29.271206
4,id0001368,$6.31,Conservador,957.64,5585.52,NaN,5067.08,4030.51,2022.61,507.39,5.922253,11.840601

## 3 - Crie um novo dataframe eliminando as linhas duplicadas

In [61]:
dfi = dfi.drop_duplicates()

In [62]:
print(f'O dataframe de "Investimento" concatenado sem duplicatas possui {dfi.shape[0]} linhas')

O dataframe de "Investimento" concatenado sem duplicatas possui 38754 linhas

## 4 - Junte o dataframe de investimento com o de cadastro
Dica: use a chave id

In [63]:
# Juntando as tabelas de cadastro com a de investimentos
df = pd.merge(dfc,dfi,how='left',on='id')
df.shape[0]

38754

In [64]:
# Exibindo primeiras linhas do arquivo conjunto de Cadastro com Investimento 
df.head()

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,$63.67,Moderado,1174.27,4980.98,2638.24,NaN,4480.91,2329.72,480.72,79.600372,9.802620
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,$21.96,Moderado,842.12,5646.09,3336.07,NaN,5624.22,2669.98,504.17,44.406893,90.512871
2,id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,$62497.64,Agressivo,818.81,5516.52,3396.64,NaN,5033.83,2229.45,523.12,44.020024,65.060941
3,id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,$99878.74,Agressivo,NaN,5258.69,3723.10,NaN,5933.91,NaN,486.05,25.597924,86.548918
4,id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,$188.01,Conservador,1505.16,6415.30,3462.67,30841.35,6044.86,2198.89,512.98,14.463307,33.566292

## 5 - Ordene o dataframe pelo id, de forma crescente e redefina o índice

In [65]:
# Ordenando df e redefinindo índice
df = df.sort_values(by=['id'],ascending=True)
df = df.reset_index(drop=True)
df.head()

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Salario,Perfil,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,$63.67,Moderado,1174.27,4980.98,2638.24,NaN,4480.91,2329.72,480.72,79.600372,9.802620
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,$21.96,Moderado,842.12,5646.09,3336.07,NaN,5624.22,2669.98,504.17,44.406893,90.512871
2,id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,$62497.64,Agressivo,818.81,5516.52,3396.64,NaN,5033.83,2229.45,523.12,44.020024,65.060941
3,id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,$99878.74,Agressivo,NaN,5258.69,3723.10,NaN,5933.91,NaN,486.05,25.597924,86.548918
4,id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,$188.01,Conservador,1505.16,6415.30,3462.67,30841.35,6044.86,2198.89,512.98,14.463307,33.566292

## 6 - Faça uma análise dos dados faltantes e trate-os

Mostre todas as colunas com dados faltantes, sua quantidade/porcentagem e como tratar (preencher) cada uma delas explicando sua estratégia

Os ativos faltantes foram convertidos em zero, pois entende-se que esses dados faltantes indicam que aquela pessoa cadastrada não possui valores investidos nos respectivos ativos.

No caso das notas, optou-se por excluir os registros que não possuiam nenhuma avaliação (165 registros - ou 0,4% do total).
Aqueles registros que possuíam apenas uma nota tiveram ela duplicada para a outra nota, de modo a manter a percepção deles
em relação à empresa. Ou seja, se um investidor preencheu apenas a Nota2, a Nota1 foi preenchida com o mesmo valor.

In [66]:
# Análise de dados faltantes e cálculo de percentual
qtd_faltantes = df.isna().sum()
registros = df.shape[0]
df_faltantes =  pd.DataFrame({'Dados faltantes': qtd_faltantes, 'Dados faltantes (%)': qtd_faltantes / registros * 100})
df_faltantes

          Dados faltantes  Dados faltantes (%)
id                      0             0.000000
Nome                    0             0.000000
Sexo                    0             0.000000
Nasc                    0             0.000000
Idade                   0             0.000000
Email                   0             0.000000
Lat_long                0             0.000000
Job                     0             0.000000
Estado                  0             0.000000
Salario                 0             0.000000
Perfil                  0             0.000000
Ativo01              9724            25.091603
Ativo02              6100            15.740311
Ativo03              6169            15.918357
Ativo04             11887            30.672963
Ativo05              6191            15.975125
Ativo06             19514            50.353512
Ativo07                 0             0.000000
Nota1                3000             7.741136
Nota2                2000             5.160758

In [67]:
# Tratamento de dados faltantes
# Preenchimento de ativos com zeros pois não houve investimento neles
values = {"Ativo01": 0, "Ativo02": 0,"Ativo03": 0,"Ativo04": 0,"Ativo05": 0,"Ativo06": 0,"Ativo07": 0}
df = df.fillna(value=values)

In [68]:
df.shape[0]

38754

In [69]:
# Registros com nota1 E nota2 vazios
df[(df['Nota1'].isnull() & df['Nota2'].isnull())].shape[0]

165

In [70]:
# Tratamento dos dados vazios nas colunas Nota1 e Nota2

df = df.dropna(subset=['Nota1', 'Nota2'], how='all') # Remove registros com ambas as notas vazias
df['Nota1'].fillna(df['Nota2'], inplace=True) # Preenche Nota1 com valor da Nota2
df['Nota2'].fillna(df['Nota1'], inplace=True) # Preenche Nota2 com valor da Nota1

In [71]:
# Nova quantidade de registros, com 165 exclusões dos investidores sem ambas as notas
df.shape[0]

38589

In [72]:
# Nova análise de dados faltantes e cálculo de percentual
qtd_faltantes = df.isna().sum()
registros = df.shape[0]
df_faltantes =  pd.DataFrame({'Dados faltantes': qtd_faltantes, 'Dados faltantes (%)': qtd_faltantes / registros * 100})
df_faltantes

          Dados faltantes  Dados faltantes (%)
id                      0                  0.0
Nome                    0                  0.0
Sexo                    0                  0.0
Nasc                    0                  0.0
Idade                   0                  0.0
Email                   0                  0.0
Lat_long                0                  0.0
Job                     0                  0.0
Estado                  0                  0.0
Salario                 0                  0.0
Perfil                  0                  0.0
Ativo01                 0                  0.0
Ativo02                 0                  0.0
Ativo03                 0                  0.0
Ativo04                 0                  0.0
Ativo05                 0                  0.0
Ativo06                 0                  0.0
Ativo07                 0                  0.0
Nota1                   0                  0.0
Nota2                   0                  0.0

## 7 - Manipule os dados a seguir:
- Criar coluna "Total" somando o valor de todos os ativos por investidor
- Criar coluna "Media" com a média das notas 1 e 2
- Criar coluna "Dominio" com apenas o domínio do email (dica: separar por @)
- Mudar o nome da coluna "Salário" para "Renda" e tratar a coluna (sem caracter $ e tipo numérica)
- Mudar os dados da coluna "Sexo" para Masculino e Feminino (tente usar o map)
- Transformar os dados da coluna Media em inteiro
- Criar coluna "NPS" onde o investidor é promotor se a média das notas é maior igual a 80, neutro se a média estiver entre 50 e 80, e detrator se for abaixo de 50

In [73]:
# Criar coluna "Total" somando o valor de todos os ativos por investidor
df['Total investido'] = df.filter(like='Ativo').sum(axis=1)
df.head()

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Salario,...,Ativo01,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2,Total investido
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,$63.67,...,1174.27,4980.98,2638.24,0.00,4480.91,2329.72,480.72,79.600372,9.802620,16084.84
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,$21.96,...,842.12,5646.09,3336.07,0.00,5624.22,2669.98,504.17,44.406893,90.512871,18622.65
2,id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,$62497.64,...,818.81,5516.52,3396.64,0.00,5033.83,2229.45,523.12,44.020024,65.060941,17518.37
3,id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,$99878.74,...,0.00,5258.69,3723.10,0.00,5933.91,0.00,486.05,25.597924,86.548918,15401.75
4,id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,$188.01,...,1505.16,6415.30,3462.67,30841.35,6044.86,2198.89,512.98,14.463307,33.566292,50981.21

In [74]:
# Criar coluna "Media" com a média das notas 1 e 2
df['Média'] = df.filter(like='Nota').mean(axis=1)
df.head()

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Salario,...,Ativo02,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2,Total investido,Média
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,$63.67,...,4980.98,2638.24,0.00,4480.91,2329.72,480.72,79.600372,9.802620,16084.84,44.701496
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,$21.96,...,5646.09,3336.07,0.00,5624.22,2669.98,504.17,44.406893,90.512871,18622.65,67.459882
2,id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,$62497.64,...,5516.52,3396.64,0.00,5033.83,2229.45,523.12,44.020024,65.060941,17518.37,54.540483
3,id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,$99878.74,...,5258.69,3723.10,0.00,5933.91,0.00,486.05,25.597924,86.548918,15401.75,56.073421
4,id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,$188.01,...,6415.30,3462.67,30841.35,6044.86,2198.89,512.98,14.463307,33.566292,50981.21,24.014800

In [75]:
# Cria coluna "Dominio" com apenas o domínio do email
emails = df.iloc[:, 5]
emails_conta_dominio = emails.str.split('@')
df['Domínio'] = emails_conta_dominio.apply(lambda email: email[1])
df.head()

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Salario,...,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2,Total investido,Média,Domínio
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,$63.67,...,2638.24,0.00,4480.91,2329.72,480.72,79.600372,9.802620,16084.84,44.701496,yahoo.com
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,$21.96,...,3336.07,0.00,5624.22,2669.98,504.17,44.406893,90.512871,18622.65,67.459882,yahoo.com
2,id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,$62497.64,...,3396.64,0.00,5033.83,2229.45,523.12,44.020024,65.060941,17518.37,54.540483,yahoo.com
3,id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,$99878.74,...,3723.10,0.00,5933.91,0.00,486.05,25.597924,86.548918,15401.75,56.073421,hotmail.com
4,id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,$188.01,...,3462.67,30841.35,6044.86,2198.89,512.98,14.463307,33.566292,50981.21,24.014800,yahoo.com

In [76]:
# Muda o nome da coluna "Salário" para "Renda" e trata a coluna (sem caracter $ e tipo numérica)
df['Salario'] = df['Salario'].replace({'\$': ''}, regex=True)
df['Salario'] = df['Salario'].astype(float)
df = df.rename(columns={'Salario': 'Renda'})
df.head()

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Renda,...,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2,Total investido,Média,Domínio
0,id0000001,Eunice Hellen do Vale,Fem,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,63.67,...,2638.24,0.00,4480.91,2329.72,480.72,79.600372,9.802620,16084.84,44.701496,yahoo.com
1,id0000002,Sebastião Castelo Branco Júnior,Masc,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,21.96,...,3336.07,0.00,5624.22,2669.98,504.17,44.406893,90.512871,18622.65,67.459882,yahoo.com
2,id0000003,Romildo Fábio de Carvalho,Masc,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,62497.64,...,3396.64,0.00,5033.83,2229.45,523.12,44.020024,65.060941,17518.37,54.540483,yahoo.com
3,id0000004,Lana Albina de Lemos Mumy,Fem,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,99878.74,...,3723.10,0.00,5933.91,0.00,486.05,25.597924,86.548918,15401.75,56.073421,hotmail.com
4,id0000005,Rose Elisângela Vyrnium de Moura,Fem,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,188.01,...,3462.67,30841.35,6044.86,2198.89,512.98,14.463307,33.566292,50981.21,24.014800,yahoo.com

In [77]:
# Muda os dados da coluna "Sexo" para Masculino e Feminino
df['Sexo'] = df['Sexo'].map({'Masc': 'Masculino', 'Fem' : 'Feminino'})
df['Sexo'].value_counts()

Feminino     19299
Masculino    19290
Name: Sexo, dtype: int64

In [78]:
# Transforma os dados da coluna Media em inteiro
df['Média'] = df['Média'][df['Média'].notnull()].astype(int)
df.head()

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Renda,...,Ativo03,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2,Total investido,Média,Domínio
0,id0000001,Eunice Hellen do Vale,Feminino,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,63.67,...,2638.24,0.00,4480.91,2329.72,480.72,79.600372,9.802620,16084.84,44,yahoo.com
1,id0000002,Sebastião Castelo Branco Júnior,Masculino,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,21.96,...,3336.07,0.00,5624.22,2669.98,504.17,44.406893,90.512871,18622.65,67,yahoo.com
2,id0000003,Romildo Fábio de Carvalho,Masculino,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,62497.64,...,3396.64,0.00,5033.83,2229.45,523.12,44.020024,65.060941,17518.37,54,yahoo.com
3,id0000004,Lana Albina de Lemos Mumy,Feminino,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,99878.74,...,3723.10,0.00,5933.91,0.00,486.05,25.597924,86.548918,15401.75,56,hotmail.com
4,id0000005,Rose Elisângela Vyrnium de Moura,Feminino,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,188.01,...,3462.67,30841.35,6044.86,2198.89,512.98,14.463307,33.566292,50981.21,24,yahoo.com

In [79]:
df['Média'].dtypes

dtype('int32')

In [80]:
# Cria coluna "NPS" onde o investidor é promotor se a média das notas é maior igual a 80, neutro se a média estiver entre 50 e 80, e detrator se for abaixo de 50
def define_nps(media):
  if media >= 80:
    return 'Promotor'
  elif media >= 50:
    return 'Neutro'
  else:
    return 'Detrator'
df['NPS'] = df['Média'].apply(define_nps)
df.head()

,id,Nome,Sexo,Nasc,Idade,Email,Lat_long,Job,Estado,Renda,...,Ativo04,Ativo05,Ativo06,Ativo07,Nota1,Nota2,Total investido,Média,Domínio,NPS
0,id0000001,Eunice Hellen do Vale,Feminino,1970-11-12,51,djones@yahoo.com,"(Decimal('24.7024355'), Decimal('-28.038258'))",Technical author,TO,63.67,...,0.00,4480.91,2329.72,480.72,79.600372,9.802620,16084.84,44,yahoo.com,Detrator
1,id0000002,Sebastião Castelo Branco Júnior,Masculino,2019-12-10,2,barnesandrea@yahoo.com,"(Decimal('21.8589875'), Decimal('122.830566'))","Biochemist, clinical",DF,21.96,...,0.00,5624.22,2669.98,504.17,44.406893,90.512871,18622.65,67,yahoo.com,Neutro
2,id0000003,Romildo Fábio de Carvalho,Masculino,2015-12-28,6,walkermichael@yahoo.com,"(Decimal('-28.2161525'), Decimal('97.140529'))","Development worker, international aid",DF,62497.64,...,0.00,5033.83,2229.45,523.12,44.020024,65.060941,17518.37,54,yahoo.com,Neutro
3,id0000004,Lana Albina de Lemos Mumy,Feminino,1993-05-03,28,cobbangela@hotmail.com,"(Decimal('-40.8557635'), Decimal('-2.936099'))",Estate manager/land agent,DF,99878.74,...,0.00,5933.91,0.00,486.05,25.597924,86.548918,15401.75,56,hotmail.com,Neutro
4,id0000005,Rose Elisângela Vyrnium de Moura,Feminino,1984-06-10,37,crawfordcraig@yahoo.com,"(Decimal('-20.2620885'), Decimal('104.349223'))",Chartered public finance accountant,MS,188.01,...,30841.35,6044.86,2198.89,512.98,14.463307,33.566292,50981.21,24,yahoo.com,Detrator

## 8 - Calcule os seguintes dados
- Calcule o total investido em cada coluna Ativo (tente usar o apply)
- Qual o menor valor investido em cada ativo?
- Mostre a média e desvio padrão de cada ativo
- Qual a idade do investidor mais velho?
- Qual a mediana da coluna Média?

In [81]:
# Total investido em cada coluna Ativo (tente usar o apply)
ativos = ['Ativo01', 'Ativo02', 'Ativo03', 'Ativo04', 'Ativo05', 'Ativo06', 'Ativo07']
total_investido = df[ativos].apply(lambda coluna: coluna.sum())

df_total_investido = pd.DataFrame({'Total investido (em milhões de reais)': (total_investido/1000000).round(2)})

df_total_investido

         Total investido (em milhões de reais)
Ativo01                                  32.62
Ativo02                                 167.34
Ativo03                                 101.88
Ativo04                                 405.46
Ativo05                                 171.32
Ativo06                                  44.42
Ativo07                                  19.30

In [82]:
# Menor valor investido em cada ativo
min_investido = df[ativos].min()
min_investido

Ativo01      0.00
Ativo02      0.00
Ativo03      0.00
Ativo04      0.00
Ativo05      0.00
Ativo06      0.00
Ativo07    462.93
dtype: float64

In [83]:
# Média e desvio padrão de cada ativo
media_investido = df[ativos].describe().T
media_investido[['mean', 'std']].rename(columns={'mean': 'Média', 'std': 'Desvio Padrão'})

                Média  Desvio Padrão
Ativo01    845.265342     524.541704
Ativo02   4336.566281    1910.254236
Ativo03   2640.034886    1205.093693
Ativo04  10507.238842    9086.052598
Ativo05   4439.701626    2069.131969
Ativo06   1150.997770    1172.047214
Ativo07    500.053941      10.002974

In [84]:
# Idade do investidor mais velho
idade_max = df['Idade'].max()
indice_idade_max = df['Idade'].argmax()
nome_idade_max = df['Nome'].iloc[indice_idade_max]

f'A pessoa investidora mais velha se chama {nome_idade_max}, com uma idade de {idade_max} anos'

'A pessoa investidora mais velha se chama Eunice Hellen do Vale, com uma idade de 51 anos'

In [85]:
# Mediana da coluna Média
print(f'A mediana da coluna "Média" é {df["Média"].median()}.')

A mediana da coluna "Média" é 49.0.

## 9 - Responder as perguntas abaixo

- Quantos investidores são promotores?
- Quantos investidores são do sexo feminino?
- Quantos investidores investiram mais de 16000 no Ativo04?
- Quantos investidores investiram mais de 16000 no Ativo04 e menos de 5000 no Ativo05?
- Quantos investidores do sexo feminino tem mais de 25 anos e investiu menos de 10000? (bonus: por que esse dado seria importante para a estratégia da nossa empresa?

- Quantos investidores tem em cada estado (dica: use groupby)
- Qual é a soma do total investido por cada estado?
- Como os investidores se distribuem em promotores, detratores e neutros?
- Qual é a média do total investido por promotores, detratores e neutros?

In [86]:
# Quantos investidores são promotores?
promotores = (df['NPS'] == 'Promotor').sum()
qtd_nps = df['NPS'].count()

f'{promotores} investidores são Promotores, o que corresponde a {(promotores/qtd_nps * 100).round(2)}% do total'

'3668 investidores são Promotores, o que corresponde a 9.51% do total'

In [87]:
# Quantos investidores são do sexo feminino?
sexo = df['Sexo'].value_counts()
qtd_sexo = sexo.sum()

df_sexo = pd.DataFrame({'Total': sexo, '%': sexo/qtd_sexo*100})
df_sexo

           Total          %
Feminino   19299  50.011661
Masculino  19290  49.988339

In [88]:
# Quantos investidores investiram mais de 16000 no Ativo04?
df[df['Ativo04'] > 16000].shape[0]

10646

In [89]:
# Quantos investidores investiram mais de 16000 no Ativo04 e menos de 5000 no Ativo05?
df[(df['Ativo04'] > 16000) & (df['Ativo05'] < 5000)].shape[0]

5354

In [90]:
# Quantos investidores do sexo feminino tem mais de 25 anos e investiu menos de 10000? (bonus: por que esse dado seria importante para a estratégia da nossa empresa?
df[(df['Sexo'] == 'Feminino') & (df['Idade'] > 25) & (df['Total investido'] < 10000)].shape[0]

440

Análises sobre os perfis dos clientes são importantes pois permitem identificar oportunidades de mercado, tomar decisões de marketing, lançar campanhas, personalizar a experiência do cliente e melhorar a percepção desses grupos em relação à empresa. 

No caso da análise de investidores do sexo feminino que possuem mais de 25 e menos de R$ 10.000,00 investidos, é possível identificar oportunidades para campanhas de marketing voltadas ao público feminino, destacando seu protagonismo em sua vida financeira e abrindo as portas do mundo dos investimentos.

Essas campanhas, além de visarem a obtenção de novas clientes, também podem beneficiar as clientes atuais da empresa, através de uma experiência diferenciada e personalizada para esse público, como plataformas de ensino para capacitação e auxílio na tomada de decisão de seus investimentos e atendentens mais preparadas para darem o suporte adequado a cada perfil. 

Isso seria capaz de melhorar a imagem da empresa perante esse público, o que aumenta a fidelização de clientes e ajuda a atrair novos investidores.

In [91]:
# Quantos investidores tem em cada estado (dica: use groupby)
df.groupby('Estado')['Estado'].count()

Estado
AC    1430
AL    1372
AM    1492
AP    1431
BA    1475
CE    1460
DF    1460
ES    1470
GO    1388
MA    1443
MG    1401
MS    1430
MT    1384
PA    1413
PB    1403
PE    1471
PI    1499
PR    1366
RJ    1458
RN    1466
RO    1434
RR    1492
RS    1388
SC    1418
SE    1314
SP    1453
TO    1378
Name: Estado, dtype: int64

In [92]:
# Qual é a soma do total investido por cada estado?
investimento_estados = df.groupby('Estado')['Total investido'].sum()
df_investimento_estados = pd.DataFrame(investimento_estados)

df_investimento_estados['Total investido'] = (df_investimento_estados['Total investido']/1000000).round(2)
df_investimento_estados = df_investimento_estados.rename(columns={'Total investido': 'Total investido (em milhões de reais)'})

df_investimento_estados

        Total investido (em milhões de reais)
Estado
AC                                      35.24
AL                                      33.68
AM                                      36.96
AP                                      34.83
BA                                      35.97
CE                                      35.82
DF                                      36.02
ES                                      36.05
GO                                      34.10
MA                                      34.69
MG                                      33.70
MS                                      35.14
MT                                      34.08
PA                                      34.71
PB                                      34.20
PE                                      35.25
PI                                      36.96
PR                                      32.86
RJ                                      35.69
RN                                      35.63
RO                                      34.18
RR                                      36.47
RS                                      34.16
SC                                      34.86
SE                                      32.37
SP                                      35.33
TO                                      33.37

In [93]:
# Como os investidores se distribuem em promotores, detratores e neutros?
nps = df['NPS'].value_counts()
qtd_nps = nps.sum()

df_nps = pd.DataFrame({'Total': nps, '%': (nps/qtd_nps*100).round(2)})
df_nps

          Total      %
Detrator  19449  50.40
Neutro    15472  40.09
Promotor   3668   9.51

In [94]:
# Qual é a média do total investido por promotores, detratores e neutros?
df.groupby('NPS')['Total investido'].mean()

NPS
Detrator    24389.167049
Neutro      24496.088985
Promotor    24261.049125
Name: Total investido, dtype: float64